{
  "1": {
    "schema": [
      {
        "ingredients": [
          "location",
          "composition"
        ],
        "carob fruit balls": [
          "composition"
        ],
        "bowl": [
          "location",
          "wetness"
        ]
      },
      {
        "carob fruit balls": [
          "shape",
          "size"
        ],
        "ingredients": [
          "location",
          "composition"
        ],
        "bowl": [
          "cleanness"
        ]
      },
      {
        "carob fruit balls": [
          "location",
          "temperature"
        ],
        "freezer": [
          "temperature"
        ]
      },
      {
        "carob fruit balls": [
          "location",
          "temperature"
        ]
      }
    ],
    "states": [
      [
        [
          "ingredients",
          "location",
          "in separate containers",
          "mixed together"
        ],
        [
          "ingredients",
          "composition",
          "separate",
          "mixed together"
        ],
        [
          "carob fruit balls",
          "composition",
          "not present",
          "present"
        ],
        [
          "bowl",
          "location",
          "in cupboard",
          "on counter"
        ],
        [
          "bowl",
          "wetness",
          "dry",
          "wet"
        ]
      ],
      [
        [
          "carob fruit balls",
          "shape",
          "not present",
          "round"
        ],
        [
          "carob fruit balls",
          "size",
          "not present",
          "small"
        ],
        [
          "ingredients",
          "location",
          "in bowl",
          "in hands"
        ],
        [
          "ingredients",
          "composition",
          "mixed",
          "divided into small balls"
        ],
        [
          "bowl",
          "cleanness",
          "clean",
          "dirty"
        ]
      ],
      [
        [
          "carob fruit balls",
          "location",
          "in hands",
          "in freezer"
        ],
        [
          "carob fruit balls",
          "temperature",
          "room temperature",
          "cold"
        ],
        [
          "freezer",
          "temperature",
          "cold",
          "colder"
        ]
      ],
      [
        [
          "carob fruit balls",
          "location",
          "in freezer",
          "in person's hand"
        ],
        [
          "carob fruit balls",
          "temperature",
          "cold",
          "room temperature"
        ]
      ]
    ],
    "global_salience": {
      "carob fruit balls": {
        "global_salience_pred": "3",
        "global_salience_explanation": "3 - Carob fruit balls are directly mentioned in the instruction and are the main focus of the recipe, but their importance is not emphasized explicitly."
      },
      "bowl": {
        "global_salience_pred": "4",
        "global_salience_explanation": "4 - The bowl is an essential tool for mixing all the ingredients together, which is the first step of the instruction."
      },
      "freezer": {
        "global_salience_pred": "4",
        "global_salience_explanation": "4 - The freezer is crucial for setting and firming up the carob fruit balls, as mentioned in the instruction."
      },
      "ingredients": {
        "global_salience_pred": "5",
        "global_salience_explanation": "5 - The ingredients are the key components of the recipe, and mixing them together is the first step mentioned in the instruction, making them vital for the success of the carob fruit balls."
      }
    },
    "local_salience": [
      {
        "carob fruit balls": {
          "local_salience_pred": "5",
          "local_salience_explanation": "Score: 5\nExplanation: The carob fruit balls are the main focus of this step, so they are the most important object in completing it."
        },
        "bowl": {
          "local_salience_pred": "4",
          "local_salience_explanation": "Score: 4\nExplanation: The bowl is necessary for mixing the ingredients together, so it plays a crucial role in completing this step. However, it is not as important as the carob fruit balls themselves."
        },
        "freezer": {
          "local_salience_pred": "2",
          "local_salience_explanation": "Score: 2\nExplanation: The freezer is not directly involved in the step of mixing the ingredients together. While it may be necessary for storing the carob fruit balls once they are made, it is not essential for completing this particular step."
        },
        "ingredients": {
          "local_salience_pred": "3",
          "local_salience_explanation": "Score: 3\nExplanation: The ingredients are necessary for making the carob fruit balls, but they are not as important as the actual act of mixing them together. While they are required for the recipe, their importance lies more in the final outcome rather than this specific step."
        }
      },
      {
        "carob fruit balls": {
          "local_salience_pred": "5",
          "local_salience_explanation": "5 - Carob fruit balls: This object is crucial for finishing this step as it is the main ingredient and the end product we are aiming for."
        },
        "bowl": {
          "local_salience_pred": "3",
          "local_salience_explanation": "3 - Bowl: While a bowl is useful for mixing and shaping the carob fruit balls, it is not as essential as the carob fruit balls themselves."
        },
        "freezer": {
          "local_salience_pred": "2",
          "local_salience_explanation": "2 - Freezer: While the freezer may be used to chill the carob fruit balls, it is not directly involved in the process of rolling the balls. Thus, its importance for finishing this step is relatively lower."
        },
        "ingredients": {
          "local_salience_pred": "4",
          "local_salience_explanation": "4 - Ingredients: The ingredients are necessary for making the carob fruit balls. Without them, the step of rolling the balls cannot be completed. However, they are not as important as the carob fruit balls themselves, thus receiving a slightly lower score."
        }
      },
      {
        "carob fruit balls": {
          "local_salience_pred": "5",
          "local_salience_explanation": "Score: 5\n\nExplanation: The carob fruit balls are the main focus of this step, so they are of the highest importance."
        },
        "bowl": {
          "local_salience_pred": "2",
          "local_salience_explanation": "Score: 2\n\nExplanation: The bowl is necessary for mixing the ingredients and shaping the carob fruit balls, but it is not as crucial as the carob fruit balls themselves."
        },
        "freezer": {
          "local_salience_pred": "4",
          "local_salience_explanation": "Score: 4\n\nExplanation: The freezer is essential for chilling and setting the carob fruit balls, which is an important step in the recipe. However, it is not as vital as the carob fruit balls themselves in terms of completing this particular step."
        },
        "ingredients": {
          "local_salience_pred": "3",
          "local_salience_explanation": "Score: 3\n\nExplanation: The ingredients are important for making the carob fruit balls, but in terms of this specific step, their importance is not as high as the freezer or the carob fruit balls themselves. Without the ingredients, you cannot make the carob fruit balls, but in this step, placing them in the freezer is the main focus."
        }
      },
      {
        "carob fruit balls": {
          "local_salience_pred": "5",
          "local_salience_explanation": "5 - Carob fruit balls are the main focus of this step, and are therefore the most important object as they are what will be served.\n"
        },
        "bowl": {
          "local_salience_pred": "2",
          "local_salience_explanation": "2 - The bowl is necessary for mixing and shaping the carob fruit balls, but it is not essential for serving them."
        },
        "freezer": {
          "local_salience_pred": "1",
          "local_salience_explanation": "1 - The freezer is not directly necessary for serving the carob fruit balls. It may be used for storing the balls before serving, but it is not an essential object for completing this step."
        },
        "ingredients": {
          "local_salience_pred": "4",
          "local_salience_explanation": "4 - The ingredients are crucial for making the carob fruit balls, including the base ingredients like carob powder, dates, nuts, and any additional flavors or toppings. Without the ingredients, there would be no carob fruit balls to serve."
        }
      }
    ]
  },
  "2": {
    "schema": [
      {
        "person": [
          "creativity",
          "ideas"
        ]
      },
      {
        "video": [
          "content",
          "length",
          "quality"
        ],
        "phone/camera": [
          "battery",
          "memory",
          "recording mode"
        ]
      },
      {
        "video": [
          "content",
          "length",
          "quality"
        ],
        "software": [
          "functionality"
        ]
      },
      {
        "video": [
          "location",
          "visibility"
        ],
        "YouTube": [
          "storage"
        ]
      }
    ],
    "states": [
      [
        [
          "person",
          "creativity",
          "low",
          "higher"
        ],
        [
          "person",
          "ideas",
          "empty",
          "filled"
        ]
      ],
      [
        [
          "video",
          "content",
          "empty",
          "filled"
        ],
        [
          "video",
          "length",
          "0",
          "increased"
        ],
        [
          "video",
          "quality",
          "low",
          "higher"
        ],
        [
          "phone/camera",
          "battery",
          "low",
          "decreased"
        ],
        [
          "phone/camera",
          "memory",
          "empty",
          "filled"
        ],
        [
          "phone/camera",
          "recording mode",
          "off",
          "on"
        ]
      ],
      [
        [
          "video",
          "content",
          "unedited",
          "edited"
        ],
        [
          "video",
          "length",
          "same",
          "after"
        ],
        [
          "video",
          "quality",
          "same",
          "after"
        ],
        [
          "software",
          "functionality",
          "low",
          "higher"
        ]
      ],
      [
        [
          "video",
          "location",
          "on computer",
          "on YouTube"
        ],
        [
          "video",
          "visibility",
          "private",
          "public"
        ],
        [
          "YouTube",
          "storage",
          "empty",
          "filled"
        ]
      ]
    ],
    "global_salience": {
      "phone/camera": {
        "global_salience_pred": "5",
        "global_salience_explanation": "Score: 5\nExplanation: The phone or camera is essential for shooting the video and capturing the content. Without it, the instruction cannot be completed."
      },
      "person": {
        "global_salience_pred": "4",
        "global_salience_explanation": "Score: 4\nExplanation: Having a person to shoot the video adds value and enhances the quality of the content. While not absolutely necessary, a person can help ensure that the video is well-framed and captures the intended footage accurately."
      },
      "software": {
        "global_salience_pred": "4",
        "global_salience_explanation": "Score: 4\nExplanation: The software is important for editing the video and making necessary adjustments to enhance its quality. While it is not essential for the initial step of uploading the video, having software can greatly improve the final result and overall user experience."
      },
      "video": {
        "global_salience_pred": "5",
        "global_salience_explanation": "Score: 5\nExplanation: The video itself is the main focus of the instruction. It is the end product that needs to be uploaded on YouTube. Without the video, the whole instruction would be meaningless."
      },
      "YouTube": {
        "global_salience_pred": "5",
        "global_salience_explanation": "Score: 5\nExplanation: YouTube is the platform where the video needs to be uploaded, and it is the main destination for sharing and watching videos online. Without YouTube, the instruction would not be complete as there would be no place to upload and share the video with others."
      }
    },
    "local_salience": [
      {
        "phone/camera": {
          "local_salience_pred": "5",
          "local_salience_explanation": "Phone - 5\nA phone is essential for coming up with a video idea as it allows you to research, brainstorm, and gather inspiration from various sources.\n\nCamera - 4\nWhile a camera is valuable to visually capture your video idea, it is not an absolute necessity, as you can use alternative methods like screen recording or create a video using images and text."
        },
        "person": {
          "local_salience_pred": "3",
          "local_salience_explanation": "Person - 3\nHaving a person can be helpful in brainstorming and discussing video ideas, but it is not a requirement as you can also come up with ideas on your own. Having someone to bounce ideas off of can add another perspective, but it is not essential to the process."
        },
        "software": {
          "local_salience_pred": "5",
          "local_salience_explanation": "Software - 5\nHaving the right software is crucial for coming up with a video idea. It allows you to edit and manipulate visuals, create graphics, add effects and transitions, and ultimately bring your idea to life. Without suitable software, it would be difficult to execute your video concept effectively."
        },
        "video": {
          "local_salience_pred": "5",
          "local_salience_explanation": "Video - 5\nThe video itself is the end result of coming up with an idea. It is the tangible representation of your concept and without it, the process would be incomplete. The video is the main output and the primary focus of the step \"Upload a video on YouTube.\""
        },
        "YouTube": {
          "local_salience_pred": "5",
          "local_salience_explanation": "YouTube - 5\nYouTube is the platform for uploading and sharing your video. It is the final destination for your content and is essential for completing the step of uploading a video on YouTube. Without YouTube, your video would not reach its intended audience."
        }
      },
      {
        "phone/camera": {
          "local_salience_pred": "5",
          "local_salience_explanation": "Phone/Camera: 5 - A phone or camera is essential for shooting the video as it is the primary tool used to capture footage."
        },
        "person": {
          "local_salience_pred": "3",
          "local_salience_explanation": "Person: 3 - While having a person can bring value to the video creation process, it is not absolutely necessary for shooting the video. A person can help with capturing the footage, but a video can still be shot without one."
        },
        "software": {
          "local_salience_pred": "4",
          "local_salience_explanation": "Software: 4 - While a phone or camera is necessary for capturing the video, having the right software for editing and processing the video is also important. Software helps in enhancing the video quality, adding effects, and exporting the final video in the desired format for uploading to YouTube."
        },
        "video": {
          "local_salience_pred": "5",
          "local_salience_explanation": "Video: 5 - The actual video itself is the main content that will be uploaded to YouTube. Without the video, there would be nothing to upload or share. The video is the central element in this step."
        },
        "YouTube": {
          "local_salience_pred": "5",
          "local_salience_explanation": "YouTube: 5 - YouTube is the platform where the video will be uploaded and made accessible to a wide audience. Without YouTube, there would be no way to share the video with others or take advantage of the platform's features for visibility and engagement."
        }
      },
      {
        "phone/camera": {
          "local_salience_pred": "3",
          "local_salience_explanation": "3 - Phone: A phone is important for recording the video, but it may not be necessary if a separate camera is used instead.\n\n4 - Camera: A camera is essential for capturing high-quality video footage, making it more important than a phone in terms of recording the video."
        },
        "person": {
          "local_salience_pred": "1",
          "local_salience_explanation": "1 - Person: While having a person present may be helpful for recording the video or providing assistance during the editing process, it is not essential for the step of editing the video using software."
        },
        "software": {
          "local_salience_pred": "5",
          "local_salience_explanation": "5 - Software: The software is crucial for editing the video and is the most important object in this step. Without the software, it would be impossible to make the necessary modifications to the video, such as cutting, adding effects, or adjusting the audio."
        },
        "video": {
          "local_salience_pred": "2",
          "local_salience_explanation": "2 - Video: The video itself is important for the step of editing because it is the content that will be modified. However, it is not as critical as the software used for editing."
        },
        "YouTube": {
          "local_salience_pred": "4",
          "local_salience_explanation": "4 - YouTube: YouTube is an important platform for uploading and sharing the video, but it is not directly related to the step of editing the video using software. However, it is still important for the overall process of uploading the video."
        }
      },
      {
        "phone/camera": {
          "local_salience_pred": "4",
          "local_salience_explanation": "4 - The phone/camera is essential for capturing the video footage that will be uploaded to YouTube."
        },
        "person": {
          "local_salience_pred": "2",
          "local_salience_explanation": "2 - While a person may be involved in the process of uploading the video, their presence is not essential as the actual task of uploading the video can be done without them."
        },
        "software": {
          "local_salience_pred": "5",
          "local_salience_explanation": "5 - The software is crucial for uploading the video to YouTube as it provides the necessary tools and platform to perform the task."
        },
        "video": {
          "local_salience_pred": "5",
          "local_salience_explanation": "5 - The video itself is the main content being uploaded to YouTube, so it holds significant importance for completing this step."
        },
        "YouTube": {
          "local_salience_pred": "5",
          "local_salience_explanation": "5 - YouTube is the platform where the video will be uploaded, making it a vital component in completing this step. Without YouTube, the video cannot be uploaded and shared with others."
        }
      }
    ]
  }
}